tests/results/results_high_load.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: tests/loadtest.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m20s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 50s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 046/500 VUs, 16 complete and 0 interrupted iterations
default   [   2% ] 046/500 VUs  00.9s/50.0s

running (0m01.9s), 096/500 VUs, 108 complete and 0 interrupted iterations
default   [   4% ] 096/500 VUs  01.9s/50.0s

running (0m02.9s), 146/500 VUs, 281 complete and 0 interrupted iterations
default   [   6% ] 146/500 VUs  02.9s/50.0s

running (0m03.9s), 196/500 VUs, 542 complete and 0 interrupted iterations
default   [   8% ] 196/500 VUs  03.9s/50.0s

running (0m04.9s), 246/500 VUs, 879 complete and 0 interrupted iterations
default   [  10% ] 246/500 VUs  04.9s/50.0s

running (0m05.9s), 296/500 VUs, 1294 complete and 0 interrupted iterations
default   [  12% ] 296/500 VUs  05.9s/50.0s

running (0m06.9s), 346/500 VUs, 1808 complete and 0 interrupted iterations
default   [  14% ] 346/500 VUs  06.9s/50.0s

running (0m07.9s), 395/500 VUs, 2348 complete and 0 interrupted iterations
default   [  16% ] 395/500 VUs  07.9s/50.0s

running (0m08.9s), 445/500 VUs, 2940 complete and 0 interrupted iterations
default   [  18% ] 445/500 VUs  08.9s/50.0s

running (0m09.9s), 495/500 VUs, 3432 complete and 0 interrupted iterations
default   [  20% ] 495/500 VUs  09.9s/50.0s

running (0m10.9s), 500/500 VUs, 4016 complete and 0 interrupted iterations
default   [  22% ] 500/500 VUs  10.9s/50.0s

running (0m11.9s), 500/500 VUs, 4564 complete and 0 interrupted iterations
default   [  24% ] 500/500 VUs  11.9s/50.0s

running (0m12.9s), 500/500 VUs, 5156 complete and 0 interrupted iterations
default   [  26% ] 500/500 VUs  12.9s/50.0s

running (0m13.9s), 500/500 VUs, 5660 complete and 0 interrupted iterations
default   [  28% ] 500/500 VUs  13.9s/50.0s

running (0m14.9s), 500/500 VUs, 6276 complete and 0 interrupted iterations
default   [  30% ] 500/500 VUs  14.9s/50.0s

running (0m15.9s), 500/500 VUs, 6973 complete and 0 interrupted iterations
default   [  32% ] 500/500 VUs  15.9s/50.0s

running (0m16.9s), 500/500 VUs, 7524 complete and 0 interrupted iterations
default   [  34% ] 500/500 VUs  16.9s/50.0s

running (0m17.9s), 500/500 VUs, 8066 complete and 0 interrupted iterations
default   [  36% ] 500/500 VUs  17.9s/50.0s

running (0m18.9s), 500/500 VUs, 8575 complete and 0 interrupted iterations
default   [  38% ] 500/500 VUs  18.9s/50.0s

running (0m19.9s), 500/500 VUs, 9052 complete and 0 interrupted iterations
default   [  40% ] 500/500 VUs  19.9s/50.0s

running (0m20.9s), 500/500 VUs, 9583 complete and 0 interrupted iterations
default   [  42% ] 500/500 VUs  20.9s/50.0s

running (0m21.9s), 500/500 VUs, 10216 complete and 0 interrupted iterations
default   [  44% ] 500/500 VUs  21.9s/50.0s

running (0m22.9s), 500/500 VUs, 10731 complete and 0 interrupted iterations
default   [  46% ] 500/500 VUs  22.9s/50.0s

running (0m23.9s), 500/500 VUs, 11335 complete and 0 interrupted iterations
default   [  48% ] 500/500 VUs  23.9s/50.0s

running (0m24.9s), 500/500 VUs, 11739 complete and 0 interrupted iterations
default   [  50% ] 500/500 VUs  24.9s/50.0s

running (0m25.9s), 500/500 VUs, 12292 complete and 0 interrupted iterations
default   [  52% ] 500/500 VUs  25.9s/50.0s

running (0m26.9s), 500/500 VUs, 12786 complete and 0 interrupted iterations
default   [  54% ] 500/500 VUs  26.9s/50.0s

running (0m27.9s), 500/500 VUs, 13245 complete and 0 interrupted iterations
default   [  56% ] 500/500 VUs  27.9s/50.0s

running (0m28.9s), 500/500 VUs, 13783 complete and 0 interrupted iterations
default   [  58% ] 500/500 VUs  28.9s/50.0s

running (0m30.0s), 500/500 VUs, 14347 complete and 0 interrupted iterations
default   [  60% ] 500/500 VUs  29.9s/50.0s

running (0m30.9s), 500/500 VUs, 14900 complete and 0 interrupted iterations
default   [  62% ] 500/500 VUs  30.9s/50.0s

running (0m31.9s), 500/500 VUs, 15522 complete and 0 interrupted iterations
default   [  64% ] 500/500 VUs  31.9s/50.0s

running (0m32.9s), 500/500 VUs, 16114 complete and 0 interrupted iterations
default   [  66% ] 500/500 VUs  32.9s/50.0s

running (0m34.0s), 500/500 VUs, 16700 complete and 0 interrupted iterations
default   [  68% ] 500/500 VUs  33.9s/50.0s

running (0m34.9s), 500/500 VUs, 17269 complete and 0 interrupted iterations
default   [  70% ] 500/500 VUs  34.9s/50.0s

running (0m35.9s), 500/500 VUs, 17641 complete and 0 interrupted iterations
default   [  72% ] 500/500 VUs  35.9s/50.0s

running (0m37.0s), 500/500 VUs, 18246 complete and 0 interrupted iterations
default   [  74% ] 500/500 VUs  37.0s/50.0s

running (0m37.9s), 500/500 VUs, 18763 complete and 0 interrupted iterations
default   [  76% ] 500/500 VUs  37.9s/50.0s

running (0m38.9s), 500/500 VUs, 19341 complete and 0 interrupted iterations
default   [  78% ] 500/500 VUs  38.9s/50.0s

running (0m39.9s), 500/500 VUs, 19728 complete and 0 interrupted iterations
default   [  80% ] 500/500 VUs  39.9s/50.0s

running (0m40.9s), 480/500 VUs, 20276 complete and 0 interrupted iterations
default   [  82% ] 480/500 VUs  40.9s/50.0s

running (0m41.9s), 423/500 VUs, 20889 complete and 0 interrupted iterations
default   [  84% ] 423/500 VUs  41.9s/50.0s

running (0m42.9s), 367/500 VUs, 21435 complete and 0 interrupted iterations
default   [  86% ] 367/500 VUs  42.9s/50.0s

running (0m43.9s), 318/500 VUs, 21954 complete and 0 interrupted iterations
default   [  88% ] 318/500 VUs  43.9s/50.0s

running (0m44.9s), 273/500 VUs, 22412 complete and 0 interrupted iterations
default   [  90% ] 273/500 VUs  44.9s/50.0s

running (0m46.0s), 220/500 VUs, 22835 complete and 0 interrupted iterations
default   [  92% ] 220/500 VUs  45.9s/50.0s

running (0m46.9s), 173/500 VUs, 23163 complete and 0 interrupted iterations
default   [  94% ] 173/500 VUs  46.9s/50.0s

running (0m47.9s), 124/500 VUs, 23414 complete and 0 interrupted iterations
default   [  96% ] 124/500 VUs  47.9s/50.0s

running (0m48.9s), 070/500 VUs, 23610 complete and 0 interrupted iterations
default   [  98% ] 070/500 VUs  48.9s/50.0s

running (0m50.0s), 019/500 VUs, 23704 complete and 0 interrupted iterations
default   [ 100% ] 019/500 VUs  49.9s/50.0s

     ✗ status is 200
      ↳  99% — ✓ 23722 / ✗ 1

     █ setup

     checks.........................: 99.99%  ✓ 23722         ✗ 1    
     data_received..................: 2.2 GB  44 MB/s
     data_sent......................: 17 MB   339 kB/s
     http_req_blocked...............: avg=24.91µs  min=875ns    med=4µs      max=34.2ms   p(90)=12.29µs  p(95)=18.32µs 
     http_req_connecting............: avg=8.55µs   min=0s       med=0s       max=34.14ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=29.58ms  min=371.79µs med=22.1ms   max=402.61ms p(90)=62.04ms  p(95)=80.52ms 
       { expected_response:true }...: avg=29.58ms  min=371.79µs med=22.1ms   max=402.61ms p(90)=62.04ms  p(95)=80.52ms 
     http_req_failed................: 0.00%   ✓ 1             ✗ 23724
     http_req_receiving.............: avg=1.04ms   min=17.16µs  med=114.91µs max=152.74ms p(90)=1.04ms   p(95)=3.8ms   
     http_req_sending...............: avg=418.44µs min=3.83µs   med=15.33µs  max=114.62ms p(90)=122.87µs p(95)=429.01µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=28.11ms  min=294.66µs med=21.18ms  max=402.48ms p(90)=58.86ms  p(95)=75.79ms 
     http_reqs......................: 23725   470.533721/s
     iteration_duration.............: avg=848.51ms min=24.69ms  med=840.6ms  max=1.53s    p(90)=1.07s    p(95)=1.14s   
     iterations.....................: 23723   470.494055/s
     vus............................: 19      min=19          max=500
     vus_max........................: 500     min=500         max=500
     ws_connecting..................: avg=200.96ms min=284.66µs med=188.88ms max=824.75ms p(90)=416.44ms p(95)=497.67ms
     ws_msgs_received...............: 6290759 124763.508473/s
     ws_msgs_sent...................: 23713   470.295727/s
     ws_session_duration............: avg=712.08ms min=11.75ms  med=702.94ms max=1.33s    p(90)=925.82ms p(95)=1s      
     ws_sessions....................: 23723   470.494055/s


running (0m50.4s), 000/500 VUs, 23723 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  50s